#!/bin/python3
print('Hello World!')
#1. Загрузить из файла входные данные в массив
#2. получить начальное значение, записать в переменную X
#3. Пока массив не кончился
    #3.1 получить второе значение из массива, записать в переменную Y
    #3.2 Сравнить две переменные
        #3.2.1 Если первая перменная меньше второй:
            #3.2.1.1 тогда увеличиваем счетчик на единицу
            #3.2.1.2 перезаписываем X на Y
#4. Вывести на экран значение счетчика