import os

fish_start = [1,2,5,1,1,4,1,5,5,5,3,4,1,2,2,5,3,5,1,3,4,1,5,2,5,1,4,1,2,2,1,5,1,1,1,2,4,3,4,2,2,4,5,4,1,2,3,5,3,4,1,1,2,2,1,3,3,2,3,2,1,2,2,3,1,1,2,5,1,2,1,1,3,1,1,5,5,4,1,1,5,1,4,3,5,1,3,3,1,1,5,2,1,2,4,4,5,5,4,4,5,4,3,5,5,1,3,5,2,4,1,1,2,2,2,4,1,2,1,5,1,3,1,1,1,2,1,2,2,1,3,3,5,3,4,2,1,5,2,1,4,1,1,5,1,1,5,4,4,1,4,2,3,5,2,5,5,2,2,4,4,1,1,1,4,4,1,3,5,4,2,5,5,4,4,2,2,3,2,1,3,4,1,5,1,4,5,2,4,5,1,3,4,1,4,3,3,1,1,3,2,1,5,5,3,1,1,2,4,5,3,1,1,1,2,5,2,4,5,1,3,2,4,5,5,1,2,3,4,4,1,4,1,1,3,3,5,1,2,5,1,2,5,4,1,1,3,2,1,1,1,3,5,1,3,2,4,3,5,4,1,1,5,3,4,2,3,1,1,4,2,1,2,2,1,1,4,3,1,1,3,5,2,1,3,2,1,1,1,2,1,1,5,1,1,2,5,1,1,4]

max_day = 256

def fish_count(born, end_day):
    old_fish = 6
    new_fish = 8
    fish_list = [born]
    # TODO: Переделать тут!
    new_fish_list = {born: 1}
    for i in range (1, end_day + 1):
        for j in range (0, len(fish_list)):
            fish_list[j] = fish_list[j] - 1
            if fish_list[j] == -1:
                fish_list[j] = old_fish
                fish_list.append(new_fish)
        print(f'{i}: {len(fish_list)}')
    return len(fish_list)

result = 0
for i in range (1, 6):
    result = result + (fish_start.count(i) * fish_count(i, max_day))

print(result)

